{"modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input", "class_name": "InputLayer", "config": {"batch_input_shape": [1, 224, 224, 1], "dtype": "float32", "sparse": false, "name": "input"}, "inbound_nodes": []}, {"name": "bw_conv1_1", "class_name": "Conv2D", "config": {"name": "bw_conv1_1", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bw_conv1_1", 0, 0, {}]]]}, {"name": "zero_padding2d_1", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "conv1_2", "class_name": "Conv2D", "config": {"name": "conv1_2", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"name": "cropping2d_1", "class_name": "Cropping2D", "config": {"name": "cropping2d_1", "trainable": true, "cropping": [[0, 1], [0, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["conv1_2", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["cropping2d_1", 0, 0, {}]]]}, {"name": "conv1_2norm", "class_name": "BatchNormalization", "config": {"name": "conv1_2norm", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "conv2_1", "class_name": "Conv2D", "config": {"name": "conv2_1", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1_2norm", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2_1", 0, 0, {}]]]}, {"name": "zero_padding2d_2", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_2", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "conv2_2", "class_name": "Conv2D", "config": {"name": "conv2_2", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]]}, {"name": "cropping2d_2", "class_name": "Cropping2D", "config": {"name": "cropping2d_2", "trainable": true, "cropping": [[0, 1], [0, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["conv2_2", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["cropping2d_2", 0, 0, {}]]]}, {"name": "conv2_2norm", "class_name": "BatchNormalization", "config": {"name": "conv2_2norm", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "conv3_1", "class_name": "Conv2D", "config": {"name": "conv3_1", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_2norm", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv3_1", 0, 0, {}]]]}, {"name": "conv3_2", "class_name": "Conv2D", "config": {"name": "conv3_2", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv3_2", 0, 0, {}]]]}, {"name": "zero_padding2d_3", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_3", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "conv3_3", "class_name": "Conv2D", "config": {"name": "conv3_3", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "cropping2d_3", "class_name": "Cropping2D", "config": {"name": "cropping2d_3", "trainable": true, "cropping": [[0, 1], [0, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["conv3_3", 0, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["cropping2d_3", 0, 0, {}]]]}, {"name": "conv3_3norm", "class_name": "BatchNormalization", "config": {"name": "conv3_3norm", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "conv4_1", "class_name": "Conv2D", "config": {"name": "conv4_1", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_3norm", 0, 0, {}]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv4_1", 0, 0, {}]]]}, {"name": "conv4_2", "class_name": "Conv2D", "config": {"name": "conv4_2", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv4_2", 0, 0, {}]]]}, {"name": "conv4_3", "class_name": "Conv2D", "config": {"name": "conv4_3", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv4_3", 0, 0, {}]]]}, {"name": "conv4_3norm", "class_name": "BatchNormalization", "config": {"name": "conv4_3norm", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"name": "conv5_1", "class_name": "Conv2D", "config": {"name": "conv5_1", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv4_3norm", 0, 0, {}]]]}, {"name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv5_1", 0, 0, {}]]]}, {"name": "conv5_2", "class_name": "Conv2D", "config": {"name": "conv5_2", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv5_2", 0, 0, {}]]]}, {"name": "conv5_3", "class_name": "Conv2D", "config": {"name": "conv5_3", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"name": "activation_13", "class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv5_3", 0, 0, {}]]]}, {"name": "conv5_3norm", "class_name": "BatchNormalization", "config": {"name": "conv5_3norm", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"name": "conv6_1", "class_name": "Conv2D", "config": {"name": "conv6_1", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv5_3norm", 0, 0, {}]]]}, {"name": "activation_14", "class_name": "Activation", "config": {"name": "activation_14", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv6_1", 0, 0, {}]]]}, {"name": "conv6_2", "class_name": "Conv2D", "config": {"name": "conv6_2", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv6_2", 0, 0, {}]]]}, {"name": "conv6_3", "class_name": "Conv2D", "config": {"name": "conv6_3", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"name": "activation_16", "class_name": "Activation", "config": {"name": "activation_16", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv6_3", 0, 0, {}]]]}, {"name": "conv6_3norm", "class_name": "BatchNormalization", "config": {"name": "conv6_3norm", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"name": "conv7_1", "class_name": "Conv2D", "config": {"name": "conv7_1", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv6_3norm", 0, 0, {}]]]}, {"name": "activation_17", "class_name": "Activation", "config": {"name": "activation_17", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv7_1", 0, 0, {}]]]}, {"name": "conv7_2", "class_name": "Conv2D", "config": {"name": "conv7_2", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"name": "activation_18", "class_name": "Activation", "config": {"name": "activation_18", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv7_2", 0, 0, {}]]]}, {"name": "conv7_3", "class_name": "Conv2D", "config": {"name": "conv7_3", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"name": "activation_19", "class_name": "Activation", "config": {"name": "activation_19", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv7_3", 0, 0, {}]]]}, {"name": "conv7_3norm", "class_name": "BatchNormalization", "config": {"name": "conv7_3norm", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"name": "conv8_1", "class_name": "Conv2DTranspose", "config": {"name": "conv8_1", "trainable": true, "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["conv7_3norm", 0, 0, {}]]]}, {"name": "activation_20", "class_name": "Activation", "config": {"name": "activation_20", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv8_1", 0, 0, {}]]]}, {"name": "conv8_2", "class_name": "Conv2D", "config": {"name": "conv8_2", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"name": "activation_21", "class_name": "Activation", "config": {"name": "activation_21", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv8_2", 0, 0, {}]]]}, {"name": "conv8_3", "class_name": "Conv2D", "config": {"name": "conv8_3", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"name": "activation_22", "class_name": "Activation", "config": {"name": "activation_22", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv8_3", 0, 0, {}]]]}, {"name": "conv8_313", "class_name": "Conv2D", "config": {"name": "conv8_313", "trainable": true, "filters": 313, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_22", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["conv8_313", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "bw_conv1_1/kernel", "shape": [3, 3, 1, 64], "dtype": "float32"}, {"name": "bw_conv1_1/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "conv1_2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv1_2/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "conv1_2norm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv1_2norm/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "conv2_1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2_1/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "conv2_2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2_2/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "conv2_2norm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv2_2norm/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "conv3_1/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv3_1/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "conv3_2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv3_2/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"name": "conv3_3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv3_3/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group10-shard1of1"], "weights": [{"name": "conv3_3norm/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv3_3norm/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group11-shard1of2", "group11-shard2of2"], "weights": [{"name": "conv4_1/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "conv4_1/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group12-shard1of3", "group12-shard2of3", "group12-shard3of3"], "weights": [{"name": "conv4_2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv4_2/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group13-shard1of3", "group13-shard2of3", "group13-shard3of3"], "weights": [{"name": "conv4_3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv4_3/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group14-shard1of1"], "weights": [{"name": "conv4_3norm/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv4_3norm/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group15-shard1of3", "group15-shard2of3", "group15-shard3of3"], "weights": [{"name": "conv5_1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv5_1/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group16-shard1of3", "group16-shard2of3", "group16-shard3of3"], "weights": [{"name": "conv5_2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv5_2/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group17-shard1of3", "group17-shard2of3", "group17-shard3of3"], "weights": [{"name": "conv5_3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv5_3/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group18-shard1of1"], "weights": [{"name": "conv5_3norm/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv5_3norm/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group19-shard1of3", "group19-shard2of3", "group19-shard3of3"], "weights": [{"name": "conv6_1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv6_1/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group20-shard1of3", "group20-shard2of3", "group20-shard3of3"], "weights": [{"name": "conv6_2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv6_2/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group21-shard1of3", "group21-shard2of3", "group21-shard3of3"], "weights": [{"name": "conv6_3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv6_3/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group22-shard1of1"], "weights": [{"name": "conv6_3norm/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv6_3norm/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group23-shard1of3", "group23-shard2of3", "group23-shard3of3"], "weights": [{"name": "conv7_1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv7_1/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group24-shard1of3", "group24-shard2of3", "group24-shard3of3"], "weights": [{"name": "conv7_2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv7_2/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group25-shard1of3", "group25-shard2of3", "group25-shard3of3"], "weights": [{"name": "conv7_3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv7_3/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group26-shard1of1"], "weights": [{"name": "conv7_3norm/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv7_3norm/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group27-shard1of3", "group27-shard2of3", "group27-shard3of3"], "weights": [{"name": "conv8_1/kernel", "shape": [4, 4, 256, 512], "dtype": "float32"}, {"name": "conv8_1/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group28-shard1of1"], "weights": [{"name": "conv8_2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv8_2/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group29-shard1of1"], "weights": [{"name": "conv8_3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv8_3/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group30-shard1of1"], "weights": [{"name": "conv8_313/kernel", "shape": [1, 1, 256, 313], "dtype": "float32"}, {"name": "conv8_313/bias", "shape": [313], "dtype": "float32"}]}]}